os/paperwork/unit-plan.org
#+TITLE:     《操作系统原理》教案
#+AUTHOR:    王晓林
#+EMAIL:     wx672ster@gmail.com
#+DATE:      2012-08-15 Wed
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  cn
#+OPTIONS:   H:4 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
# (setq org-export-html-use-infojs nil)

#+LaTeX: \clearpage
- 课程名称: 操作系统原理
- 面向专业: 计算机相关本科专业
- 教材参考：
  1. A.S. Tanenbaum. Modern Operating Systems, 3e. Pearson Prentice Hall, 2008. 
  2. Silberschatz, Galvin, and Gagne. Operating System Concepts Essentials. John Wiley & Sons, 2011.
- 授课学期：大三第一学期
- 任课教师：王晓林
- 编写时间：[2012-08-15 Wed]
* 操作系统简介
** 教学目标及基本要求
   了解什么是操作系统，及相关基本概念。
** 教学内容及学时分配
   - [[./slides/intro-a.pdf][讲义]]
   - [[./slides/intro-b.pdf][幻灯片]]
   - [[./lab.html#sec-3][作业]]
*** What's an OS? (0.5h)
**** 教学内容（具体到知识点）
     - Resource manager
     - Control program
     - System goals -- convenient vs. efficient
     - History of OS
     - Various OSes
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
     课堂讲授，课后答疑
*** OS services (0.5h)
