os/paperwork/unit-plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="cn" xml:lang="cn">
<head>
<title>《操作系统原理》教案</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="《操作系统原理》教案"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-15 Wed"/>
<meta name="author" content="王晓林"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">《操作系统原理》教案</h1>


<ul>
<li>课程名称: 操作系统原理
</li>
<li>面向专业: 计算机相关本科专业
</li>
<li>教材参考：
<ol>
<li>A.S. Tanenbaum. Modern Operating Systems, 3e. Pearson Prentice Hall, 2008. 
</li>
<li>Silberschatz, Galvin, and Gagne. Operating System Concepts Essentials. John Wiley &amp; Sons, 2011.
</li>
</ol>

</li>
<li>授课学期：大三第一学期
</li>
<li>任课教师：王晓林
</li>
<li>编写时间： <span class="timestamp-wrapper"> <span class="timestamp">2012-08-15 Wed</span></span>
</li>
</ul>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 操作系统简介</a>
<ul>
<li><a href="#sec-1-1">1.1 教学目标及基本要求</a></li>
<li><a href="#sec-1-2">1.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 What's an OS? (0.5h)</a>
<ul>
<li><a href="#sec-1-2-1-1">1.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-1-2-1-2">1.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-1-2-2">1.2.2 OS services (0.5h)</a>
<ul>
<li><a href="#sec-1-2-2-1">1.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-1-2-2-2">1.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-1-2-3">1.2.3 Bootstrapping (1h)</a>
<ul>
<li><a href="#sec-1-2-3-1">1.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-1-2-3-2">1.2.3.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-1-2-4">1.2.4 Hardware (0.5h)</a>
<ul>
<li><a href="#sec-1-2-4-1">1.2.4.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-1-2-4-2">1.2.4.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-1-2-5">1.2.5 Interrupt (1h)</a>
<ul>
<li><a href="#sec-1-2-5-1">1.2.5.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-1-2-5-2">1.2.5.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-1-2-6">1.2.6 System calls (1h)</a>
<ul>
<li><a href="#sec-1-2-6-1">1.2.6.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-1-2-6-2">1.2.6.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 重点和难点</a></li>
<li><a href="#sec-1-4">1.4 深化和拓宽</a></li>
<li><a href="#sec-1-5">1.5 教学方式（手段）及教学过程中应注意的问题</a></li>
</ul>
</li>
<li><a href="#sec-2">2 进程与线程</a>
<ul>
<li><a href="#sec-2-1">2.1 教学目标及基本要求</a></li>
<li><a href="#sec-2-2">2.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 What's a process? (.5h)</a>
<ul>
<li><a href="#sec-2-2-1-1">2.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-1-2">2.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-2">2.2.2 Process creation (1h)</a>
<ul>
<li><a href="#sec-2-2-2-1">2.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-2-2">2.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-3">2.2.3 Process state (.5h)</a>
<ul>
<li><a href="#sec-2-2-3-1">2.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-3-2">2.2.3.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-4">2.2.4 Process Control Block(PCB) (1h)</a>
<ul>
<li><a href="#sec-2-2-4-1">2.2.4.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-4-2">2.2.4.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-5">2.2.5 CPU switch from process to process (.5h)</a>
<ul>
<li><a href="#sec-2-2-5-1">2.2.5.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-5-2">2.2.5.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-6">2.2.6 Processes vs. threads (.5h)</a>
<ul>
<li><a href="#sec-2-2-6-1">2.2.6.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-6-2">2.2.6.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-7">2.2.7 Why thread? (.5)</a>
<ul>
<li><a href="#sec-2-2-7-1">2.2.7.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-7-2">2.2.7.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-8">2.2.8 Thread characteristics (.5)</a>
<ul>
<li><a href="#sec-2-2-8-1">2.2.8.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-8-2">2.2.8.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-9">2.2.9 Thread operation and POSIX threads (1h)</a>
<ul>
<li><a href="#sec-2-2-9-1">2.2.9.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-9-2">2.2.9.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-10">2.2.10 User-level threads vs. kernel-level threads (.5h)</a>
<ul>
<li><a href="#sec-2-2-10-1">2.2.10.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-10-2">2.2.10.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-11">2.2.11 Linux threads (1h)</a>
<ul>
<li><a href="#sec-2-2-11-1">2.2.11.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-11-2">2.2.11.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 重点和难点</a></li>
<li><a href="#sec-2-4">2.4 深化和拓宽</a></li>
<li><a href="#sec-2-5">2.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-2-6">2.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-3">3 进程间同步</a>
<ul>
<li><a href="#sec-3-1">3.1 教学目标及基本要求</a></li>
<li><a href="#sec-3-2">3.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 Inter-process communication (.5h)</a>
<ul>
<li><a href="#sec-3-2-1-1">3.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-1-2">3.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-3-2-2">3.2.2 Shared memory (1h)</a>
<ul>
<li><a href="#sec-3-2-2-1">3.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-2-2">3.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-3-2-3">3.2.3 Race condition and mutual exclusion (2h)</a>
<ul>
<li><a href="#sec-3-2-3-1">3.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-3-2">3.2.3.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-3-2-4">3.2.4 Semaphores (2h)</a>
<ul>
<li><a href="#sec-3-2-4-1">3.2.4.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-4-2">3.2.4.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-3-2-5">3.2.5 Monitors (1h)</a>
<ul>
<li><a href="#sec-3-2-5-1">3.2.5.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-5-2">3.2.5.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-3-2-6">3.2.6 Message passing (1h)</a>
<ul>
<li><a href="#sec-3-2-6-1">3.2.6.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-6-2">3.2.6.2 教学方式（手段）</a></li>
<li><a href="#sec-3-2-6-3">3.2.6.3 师生活动设计</a></li>
</ul>
</li>
<li><a href="#sec-3-2-7">3.2.7 Classical IPC problems (2h)</a>
<ul>
<li><a href="#sec-3-2-7-1">3.2.7.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-7-2">3.2.7.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 重点和难点</a></li>
<li><a href="#sec-3-4">3.4 深化和拓宽</a></li>
<li><a href="#sec-3-5">3.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-3-6">3.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-4">4 CPU调度</a>
<ul>
<li><a href="#sec-4-1">4.1 教学目标及基本要求</a></li>
<li><a href="#sec-4-2">4.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 Scheduling introduction (1h)</a>
<ul>
<li><a href="#sec-4-2-1-1">4.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-4-2-1-2">4.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-4-2-2">4.2.2 Scheduling algorithms (1h)</a>
<ul>
<li><a href="#sec-4-2-2-1">4.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-4-2-2-2">4.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-4-2-3">4.2.3 Thread scheduling (.5h)</a>
<ul>
<li><a href="#sec-4-2-3-1">4.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-4-2-3-2">4.2.3.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-4-2-4">4.2.4 Linux scheduling (1h)</a>
<ul>
<li><a href="#sec-4-2-4-1">4.2.4.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-4-2-4-2">4.2.4.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 重点和难点</a></li>
<li><a href="#sec-4-4">4.4 深化和拓宽</a></li>
<li><a href="#sec-4-5">4.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-4-6">4.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-5">5 死锁</a>
<ul>
<li><a href="#sec-5-1">5.1 教学目标及基本要求</a></li>
<li><a href="#sec-5-2">5.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1 Resources (.5h)</a>
<ul>
<li><a href="#sec-5-2-1-1">5.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-5-2-1-2">5.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-5-2-2">5.2.2 Introduction to deadlock (.5h)</a>
<ul>
<li><a href="#sec-5-2-2-1">5.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-5-2-2-2">5.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-5-2-3">5.2.3 Deadlock modeling (.5h)</a>
<ul>
<li><a href="#sec-5-2-3-1">5.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-5-2-3-2">5.2.3.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-5-2-4">5.2.4 Dealing with deadlocks (2h)</a>
<ul>
<li><a href="#sec-5-2-4-1">5.2.4.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-5-2-4-2">5.2.4.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3 重点和难点</a></li>
<li><a href="#sec-5-4">5.4 深化和拓宽</a></li>
<li><a href="#sec-5-5">5.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-5-6">5.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-6">6 内存管理</a>
<ul>
<li><a href="#sec-6-1">6.1 教学目标及基本要求</a></li>
<li><a href="#sec-6-2">6.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1 Real-mode vs. protected-mode memory management (1.5h)</a>
<ul>
<li><a href="#sec-6-2-1-1">6.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-6-2-1-2">6.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-6-2-2">6.2.2 Contiguous memory allocation (.5h)</a>
<ul>
<li><a href="#sec-6-2-2-1">6.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-6-2-2-2">6.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-6-2-3">6.2.3 Virtual memory (5h)</a>
<ul>
<li><a href="#sec-6-2-3-1">6.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-6-2-3-2">6.2.3.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3 重点和难点</a></li>
<li><a href="#sec-6-4">6.4 深化和拓宽</a></li>
<li><a href="#sec-6-5">6.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-6-6">6.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-7">7 文件系统</a>
<ul>
<li><a href="#sec-7-1">7.1 教学目标及基本要求</a></li>
<li><a href="#sec-7-2">7.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-7-2-1">7.2.1 Files (1.5h)</a>
<ul>
<li><a href="#sec-7-2-1-1">7.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-7-2-1-2">7.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-7-2-2">7.2.2 Directories (1h)</a>
<ul>
<li><a href="#sec-7-2-2-1">7.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-7-2-2-2">7.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-7-2-3">7.2.3 File system implementation (3h)</a>
<ul>
<li><a href="#sec-7-2-3-1">7.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-7-2-3-2">7.2.3.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-7-2-4">7.2.4 Ext2 file system (1.5h)</a>
<ul>
<li><a href="#sec-7-2-4-1">7.2.4.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-7-2-4-2">7.2.4.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-7-2-5">7.2.5 Virtual file system (1.5h)</a>
<ul>
<li><a href="#sec-7-2-5-1">7.2.5.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-7-2-5-2">7.2.5.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7-3">7.3 重点和难点</a></li>
<li><a href="#sec-7-4">7.4 深化和拓宽</a></li>
<li><a href="#sec-7-5">7.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-7-6">7.6 参考书目</a></li>
<li><a href="#sec-7-7">7.7 思考题和习题</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 操作系统简介</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-1-1">

<p>   了解什么是操作系统，及相关基本概念。
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li><a href="./slides/intro-a.pdf">讲义</a>
</li>
<li><a href="./slides/intro-b.pdf">幻灯片</a>
</li>
<li><a href="./lab.html#sec-3">作业</a>
</li>
</ul>


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> What's an OS? (0.5h)</h4>
<div class="outline-text-4" id="text-1-2-1">


</div>

<div id="outline-container-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1"><span class="section-number-5">1.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-1-2-1-1">

<ul>
<li>Resource manager
</li>
<li>Control program
</li>
<li>System goals &ndash; convenient vs. efficient
</li>
<li>History of OS
</li>
<li>Various OSes
</li>
</ul>

</div>

</div>
