os/paperwork/unit-plan.tex
% Created 2015-12-06 Sun 21:50
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{fullpage}
\usepackage{indentfirst}
\usepackage[indentafter,pagestyles]{titlesec}
\usepackage{minted}
\usepackage{xltxtra}
\usepackage{xeCJK}
\tolerance=1000
\setlength{\parindent}{2.5em}
\setmainfont{DejaVu Serif}
\setsansfont{DejaVu Sans}
\setmonofont{DejaVu Sans Mono}
\setCJKmainfont[BoldFont={WenQuanYi Zen Hei}]{SimSun}
\setCJKfamilyfont{hei}{WenQuanYi Zen Hei}
\setCJKfamilyfont{song}{SimSun}
\XeTeXlinebreaklocale "zh"
\XeTeXlinebreakskip = 0pt plus 1pt
\graphicspath{{./figs/}{../figs/}{./}{../}}
\renewcommand{\contentsname}{目录}
\renewcommand{\listfigurename}{插图目录}
\renewcommand{\listtablename}{表格目录}
\renewcommand{\abstractname}{摘要}
\renewcommand{\appendixname}{附录}
\renewcommand{\indexname}{索引}
\renewcommand{\figurename}{图}
\renewcommand{\tablename}{表}
\author{王晓林}
\date{2015-06-20}
\title{《操作系统原理》教案}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\clearpage
\begin{itemize}
\item 课程名称: 操作系统原理
\item 面向专业: 计算机相关本科专业
\item 教材参考：
\begin{enumerate}
\item A.S. Tanenbaum. Modern Operating Systems, 3e. Pearson Prentice Hall, 2008.
\item Silberschatz, Galvin, and Gagne. Operating System Concepts Essentials. John Wiley \& Sons, 2011.
\end{enumerate}
\item 授课学期：大三第一学期
\item 任课教师：王晓林
\item 编写时间：\textit{[2016-06-20]}
\end{itemize}
\section{操作系统简介}
\label{sec-1}
\subsection{教学目标及基本要求}
\label{sec-1-1}
了解什么是操作系统，及相关基本概念。
\subsection{教学内容及学时分配}
\label{sec-1-2}
\begin{itemize}
\item \href{./slides/intro-a.pdf}{讲义}
\item \href{./slides/intro-b.pdf}{幻灯片}
\item \href{./lab.html#sec-3}{作业}
\end{itemize}
\subsubsection{What's an OS? (0.5h)}
\label{sec-1-2-1}
\paragraph{教学内容（具体到知识点）}
\label{sec-1-2-1-1}
\begin{itemize}
\item Resource manager
\item Control program
\item System goals -- convenient vs. efficient
\item History of OS
\item Various OSes
\end{itemize}
