os/paperwork/unit-plan.org
**** 教学内容（具体到知识点）
     - Helping the user
     - Keeping the system efficient
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
     课堂讲授，课后答疑
*** Bootstrapping (1h)
**** 教学内容（具体到知识点）
     - Intel x86 bootstrapping
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
     课堂讲授，课后答疑
*** Hardware (0.5h)
**** 教学内容（具体到知识点）
     - CPU working cycle
     - CPU registers
     - System bus
     - Controllers and Peripherals 
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Interrupt (1h)
**** 教学内容（具体到知识点）
     - Why interrupt?
     - Interrupt timeline
     - Concepts: 
       - hardware interrupt
       - software interrupt
       - trap
       - interrupt vector
     - Interrupt processing
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** System calls (1h)
**** 教学内容（具体到知识点）
     - What's a system call?
     - How a system call works?
     - Various system calls
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - Bootstrapping
   - Interrupt
   - System calls
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   - 理论 + 实验
** 参考书目						   :noexport:
** 思考题和习题							   :noexport:
* 进程与线程
** 教学目标及基本要求
   了解进程和线程相关的基本概念。
** 教学内容及学时分配
  - [[./slides/process-thread-a.pdf][讲义]]
  - [[./slides/process-thread-b.pdf][幻灯片]]
  - [[./lab.html#sec-4][作业]]
*** What's a process? (.5h)
**** 教学内容（具体到知识点）
     - logical view of a process
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Process creation (1h)
**** 教学内容（具体到知识点）
     - fork(), exec(), wait(), exit()
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Process state (.5h)
**** 教学内容（具体到知识点）
     - running, blocked, ready
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Process Control Block(PCB) (1h)
**** 教学内容（具体到知识点）
     - How to describe a process?
     - =task_struct= in Linux
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** CPU switch from process to process (.5h)
**** 教学内容（具体到知识点）
     - The OS role in process switch
**** 教学方式（手段）
**** 师生活动设计						   :noexport:
*** Processes vs. threads (.5h)
**** 教学内容（具体到知识点）
     - A process is a unit of resource ownership
     - A thread is a unit of scheduling
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Why thread? (.5)
**** 教学内容（具体到知识点）
     - Advantages 
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
