os/paperwork/unit-plan.html

<div id="outline-container-1-2-1-2" class="outline-5">
<h5 id="sec-1-2-1-2"><span class="section-number-5">1.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-1-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> OS services (0.5h)</h4>
<div class="outline-text-4" id="text-1-2-2">


</div>

<div id="outline-container-1-2-2-1" class="outline-5">
<h5 id="sec-1-2-2-1"><span class="section-number-5">1.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-1-2-2-1">

<ul>
<li>Helping the user
</li>
<li>Keeping the system efficient
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-2-2" class="outline-5">
<h5 id="sec-1-2-2-2"><span class="section-number-5">1.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-1-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Bootstrapping (1h)</h4>
<div class="outline-text-4" id="text-1-2-3">


</div>

<div id="outline-container-1-2-3-1" class="outline-5">
<h5 id="sec-1-2-3-1"><span class="section-number-5">1.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-1-2-3-1">

<ul>
<li>Intel x86 bootstrapping
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-3-2" class="outline-5">
<h5 id="sec-1-2-3-2"><span class="section-number-5">1.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-1-2-3-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Hardware (0.5h)</h4>
<div class="outline-text-4" id="text-1-2-4">


</div>

<div id="outline-container-1-2-4-1" class="outline-5">
<h5 id="sec-1-2-4-1"><span class="section-number-5">1.2.4.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-1-2-4-1">

<ul>
<li>CPU working cycle
</li>
<li>CPU registers
</li>
<li>System bus
</li>
<li>Controllers and Peripherals 
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-4-2" class="outline-5">
<h5 id="sec-1-2-4-2"><span class="section-number-5">1.2.4.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-1-2-4-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Interrupt (1h)</h4>
<div class="outline-text-4" id="text-1-2-5">


</div>

<div id="outline-container-1-2-5-1" class="outline-5">
<h5 id="sec-1-2-5-1"><span class="section-number-5">1.2.5.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-1-2-5-1">

<ul>
<li>Why interrupt?
</li>
<li>Interrupt timeline
</li>
<li>Concepts: 
<ul>
<li>hardware interrupt
</li>
<li>software interrupt
</li>
<li>trap
</li>
<li>interrupt vector
</li>
</ul>

</li>
<li>Interrupt processing
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-5-2" class="outline-5">
<h5 id="sec-1-2-5-2"><span class="section-number-5">1.2.5.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-1-2-5-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> System calls (1h)</h4>
<div class="outline-text-4" id="text-1-2-6">


</div>

<div id="outline-container-1-2-6-1" class="outline-5">
<h5 id="sec-1-2-6-1"><span class="section-number-5">1.2.6.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-1-2-6-1">

<ul>
<li>What's a system call?
</li>
<li>How a system call works?
</li>
<li>Various system calls
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-6-2" class="outline-5">
<h5 id="sec-1-2-6-2"><span class="section-number-5">1.2.6.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-1-2-6-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>Bootstrapping
</li>
<li>Interrupt
</li>
<li>System calls
</li>
</ul>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-1-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li>理论 + 实验
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 进程与线程</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-2-1">

<p>   了解进程和线程相关的基本概念。
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li><a href="./slides/process-thread-a.pdf">讲义</a>
</li>
<li><a href="./slides/process-thread-b.pdf">幻灯片</a>
</li>
<li><a href="./lab.html#sec-4">作业</a>
</li>
</ul>


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> What's a process? (.5h)</h4>
<div class="outline-text-4" id="text-2-2-1">


</div>

<div id="outline-container-2-2-1-1" class="outline-5">
<h5 id="sec-2-2-1-1"><span class="section-number-5">2.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-1-1">

<ul>
<li>logical view of a process
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-1-2" class="outline-5">
<h5 id="sec-2-2-1-2"><span class="section-number-5">2.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Process creation (1h)</h4>
<div class="outline-text-4" id="text-2-2-2">


</div>

<div id="outline-container-2-2-2-1" class="outline-5">
<h5 id="sec-2-2-2-1"><span class="section-number-5">2.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-2-1">

<ul>
<li>fork(), exec(), wait(), exit()
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-2-2" class="outline-5">
<h5 id="sec-2-2-2-2"><span class="section-number-5">2.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Process state (.5h)</h4>
<div class="outline-text-4" id="text-2-2-3">


</div>

<div id="outline-container-2-2-3-1" class="outline-5">
<h5 id="sec-2-2-3-1"><span class="section-number-5">2.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-3-1">

<ul>
<li>running, blocked, ready
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-3-2" class="outline-5">
<h5 id="sec-2-2-3-2"><span class="section-number-5">2.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-3-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> Process Control Block(PCB) (1h)</h4>
<div class="outline-text-4" id="text-2-2-4">


</div>

<div id="outline-container-2-2-4-1" class="outline-5">
<h5 id="sec-2-2-4-1"><span class="section-number-5">2.2.4.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-4-1">

<ul>
<li>How to describe a process?
</li>
<li><code>task_struct</code> in Linux
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-4-2" class="outline-5">
<h5 id="sec-2-2-4-2"><span class="section-number-5">2.2.4.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-4-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> CPU switch from process to process (.5h)</h4>
<div class="outline-text-4" id="text-2-2-5">


</div>

<div id="outline-container-2-2-5-1" class="outline-5">
<h5 id="sec-2-2-5-1"><span class="section-number-5">2.2.5.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-5-1">

<ul>
<li>The OS role in process switch
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-5-2" class="outline-5">
<h5 id="sec-2-2-5-2"><span class="section-number-5">2.2.5.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-5-2">

</div>
</div>

</div>

<div id="outline-container-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> Processes vs. threads (.5h)</h4>
<div class="outline-text-4" id="text-2-2-6">


</div>

<div id="outline-container-2-2-6-1" class="outline-5">
<h5 id="sec-2-2-6-1"><span class="section-number-5">2.2.6.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-6-1">

<ul>
<li>A process is a unit of resource ownership
</li>
<li>A thread is a unit of scheduling
</li>
</ul>

</div>

</div>
