os/paperwork/unit-plan.tex
\paragraph{教学方式（手段）}
\label{sec-1-2-1-2}
理论 + 实验
\subsubsection{OS services (0.5h)}
\label{sec-1-2-2}
\paragraph{教学内容（具体到知识点）}
\label{sec-1-2-2-1}
\begin{itemize}
\item Helping the user
\item Keeping the system efficient
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-1-2-2-2}
理论 + 实验
\subsubsection{Bootstrapping (1h)}
\label{sec-1-2-3}
\paragraph{教学内容（具体到知识点）}
\label{sec-1-2-3-1}
\begin{itemize}
\item Intel x86 bootstrapping
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-1-2-3-2}
理论 + 实验
\subsubsection{Hardware (0.5h)}
\label{sec-1-2-4}
\paragraph{教学内容（具体到知识点）}
\label{sec-1-2-4-1}
\begin{itemize}
\item CPU working cycle
\item CPU registers
\item System bus
\item Controllers and Peripherals
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-1-2-4-2}
理论 + 实验
\subsubsection{Interrupt (1h)}
\label{sec-1-2-5}
\paragraph{教学内容（具体到知识点）}
\label{sec-1-2-5-1}
\begin{itemize}
\item Why interrupt?
\item Interrupt timeline
\item Concepts: 
\begin{itemize}
\item hardware interrupt
\item software interrupt
\item trap
\item interrupt vector
\end{itemize}
\item Interrupt processing
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-1-2-5-2}
理论 + 实验
\subsubsection{System calls (1h)}
\label{sec-1-2-6}
\paragraph{教学内容（具体到知识点）}
\label{sec-1-2-6-1}
\begin{itemize}
\item What's a system call?
\item How a system call works?
\item Various system calls
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-1-2-6-2}
理论 + 实验
\subsection{重点和难点}
\label{sec-1-3}
\begin{itemize}
\item Bootstrapping
\item Interrupt
\item System calls
\end{itemize}
\subsection{深化和拓宽}
\label{sec-1-4}
暂无
\subsection{教学方式（手段）及教学过程中应注意的问题}
\label{sec-1-5}
\begin{itemize}
\item 理论 + 实验
\end{itemize}
\section{进程与线程}
\label{sec-2}
\subsection{教学目标及基本要求}
\label{sec-2-1}
了解进程和线程相关的基本概念。
\subsection{教学内容及学时分配}
\label{sec-2-2}
\begin{itemize}
\item \href{./slides/process-thread-a.pdf}{讲义}
\item \href{./slides/process-thread-b.pdf}{幻灯片}
\item \href{./lab.html#sec-4}{作业}
\end{itemize}
\subsubsection{What's a process? (.5h)}
\label{sec-2-2-1}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-1-1}
\begin{itemize}
\item logical view of a process
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-1-2}
理论 + 实验
\subsubsection{Process creation (1h)}
\label{sec-2-2-2}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-2-1}
\begin{itemize}
\item fork(), exec(), wait(), exit()
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-2-2}
理论 + 实验
\subsubsection{Process state (.5h)}
\label{sec-2-2-3}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-3-1}
\begin{itemize}
\item running, blocked, ready
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-3-2}
理论 + 实验
\subsubsection{Process Control Block(PCB) (1h)}
\label{sec-2-2-4}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-4-1}
\begin{itemize}
\item How to describe a process?
\item \texttt{task\_struct} in Linux
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-4-2}
理论 + 实验
\subsubsection{CPU switch from process to process (.5h)}
\label{sec-2-2-5}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-5-1}
\begin{itemize}
\item The OS role in process switch
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-5-2}
\subsubsection{Processes vs. threads (.5h)}
\label{sec-2-2-6}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-6-1}
\begin{itemize}
\item A process is a unit of resource ownership
\item A thread is a unit of scheduling
\end{itemize}
