os/paperwork/unit-plan.org
*** Thread characteristics (.5)
**** 教学内容（具体到知识点）
     - Thread state
     - A thread has its own stack
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Thread operation and POSIX threads (1h)
**** 教学内容（具体到知识点）
     - Thread library calls
     - POSIX threads examples
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** User-level threads vs. kernel-level threads (.5h)
**** 教学内容（具体到知识点）
     - pros and cons
     - Hybrid implementations
     - Programming complications
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Linux threads (1h)
**** 教学内容（具体到知识点）
     - clone()
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - 进程的一生
   - 线程的一生
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* 进程间同步
** 教学目标及基本要求
   了解进程间协调的基本概念和方法。
** 教学内容及学时分配
  - [[./slides/process-sync-a.pdf][讲义]]
  - [[./slides/process-sync-b.pdf][幻灯片]]
  - [[./lab.html#sec-4-3][作业]]
*** Inter-process communication (.5h)
**** 教学内容（具体到知识点）
     - IPC issues
     - Two models of IPC
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Shared memory (1h)
**** 教学内容（具体到知识点）
     - Producer-consumer problem
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Race condition and mutual exclusion (2h)
**** 教学内容（具体到知识点）
     - Race scenarios
     - Critical regions
     - Algorithms: 
       - busy-waiting
	 - disable interrupts 
	 - Peterson's algorithm
	 - Hardware solution --- TSL instruction
       - No busy-waiting
	 - sleep/wake up
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Semaphores (2h)
**** 教学内容（具体到知识点）
     - What's a semaphore?
     - Why semaphore?
     - How to use semaphore?
     - Mutex
     - Barriers
     - Examples
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Monitors (1h)
**** 教学内容（具体到知识点）
     - What's a monitor?
     - Examples
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Message passing (1h)
**** 教学内容（具体到知识点）
     - What's messaging?
     - Examples
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计
*** Classical IPC problems (2h)
