os/paperwork/unit-plan.html

<div id="outline-container-2-2-6-2" class="outline-5">
<h5 id="sec-2-2-6-2"><span class="section-number-5">2.2.6.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-6-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-7" class="outline-4">
<h4 id="sec-2-2-7"><span class="section-number-4">2.2.7</span> Why thread? (.5)</h4>
<div class="outline-text-4" id="text-2-2-7">


</div>

<div id="outline-container-2-2-7-1" class="outline-5">
<h5 id="sec-2-2-7-1"><span class="section-number-5">2.2.7.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-7-1">

<ul>
<li>Advantages 
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-7-2" class="outline-5">
<h5 id="sec-2-2-7-2"><span class="section-number-5">2.2.7.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-7-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-8" class="outline-4">
<h4 id="sec-2-2-8"><span class="section-number-4">2.2.8</span> Thread characteristics (.5)</h4>
<div class="outline-text-4" id="text-2-2-8">


</div>

<div id="outline-container-2-2-8-1" class="outline-5">
<h5 id="sec-2-2-8-1"><span class="section-number-5">2.2.8.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-8-1">

<ul>
<li>Thread state
</li>
<li>A thread has its own stack
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-8-2" class="outline-5">
<h5 id="sec-2-2-8-2"><span class="section-number-5">2.2.8.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-8-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-9" class="outline-4">
<h4 id="sec-2-2-9"><span class="section-number-4">2.2.9</span> Thread operation and POSIX threads (1h)</h4>
<div class="outline-text-4" id="text-2-2-9">


</div>

<div id="outline-container-2-2-9-1" class="outline-5">
<h5 id="sec-2-2-9-1"><span class="section-number-5">2.2.9.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-9-1">

<ul>
<li>Thread library calls
</li>
<li>POSIX threads examples
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-9-2" class="outline-5">
<h5 id="sec-2-2-9-2"><span class="section-number-5">2.2.9.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-9-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-10" class="outline-4">
<h4 id="sec-2-2-10"><span class="section-number-4">2.2.10</span> User-level threads vs. kernel-level threads (.5h)</h4>
<div class="outline-text-4" id="text-2-2-10">


</div>

<div id="outline-container-2-2-10-1" class="outline-5">
<h5 id="sec-2-2-10-1"><span class="section-number-5">2.2.10.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-10-1">

<ul>
<li>pros and cons
</li>
<li>Hybrid implementations
</li>
<li>Programming complications
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-10-2" class="outline-5">
<h5 id="sec-2-2-10-2"><span class="section-number-5">2.2.10.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-10-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-11" class="outline-4">
<h4 id="sec-2-2-11"><span class="section-number-4">2.2.11</span> Linux threads (1h)</h4>
<div class="outline-text-4" id="text-2-2-11">


</div>

<div id="outline-container-2-2-11-1" class="outline-5">
<h5 id="sec-2-2-11-1"><span class="section-number-5">2.2.11.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-11-1">

<ul>
<li>clone()
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-11-2" class="outline-5">
<h5 id="sec-2-2-11-2"><span class="section-number-5">2.2.11.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-11-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li>进程的一生
</li>
<li>线程的一生
</li>
</ul>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-2-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-2-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-2-6">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 进程间同步</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-3-1">

<p>   了解进程间协调的基本概念和方法。
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li><a href="./slides/process-sync-a.pdf">讲义</a>
</li>
<li><a href="./slides/process-sync-b.pdf">幻灯片</a>
</li>
<li><a href="./lab.html#sec-4-3">作业</a>
</li>
</ul>


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Inter-process communication (.5h)</h4>
<div class="outline-text-4" id="text-3-2-1">


</div>

<div id="outline-container-3-2-1-1" class="outline-5">
<h5 id="sec-3-2-1-1"><span class="section-number-5">3.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-1-1">

<ul>
<li>IPC issues
</li>
<li>Two models of IPC
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-1-2" class="outline-5">
<h5 id="sec-3-2-1-2"><span class="section-number-5">3.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Shared memory (1h)</h4>
<div class="outline-text-4" id="text-3-2-2">


</div>

<div id="outline-container-3-2-2-1" class="outline-5">
<h5 id="sec-3-2-2-1"><span class="section-number-5">3.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-2-1">

<ul>
<li>Producer-consumer problem
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-2-2" class="outline-5">
<h5 id="sec-3-2-2-2"><span class="section-number-5">3.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Race condition and mutual exclusion (2h)</h4>
<div class="outline-text-4" id="text-3-2-3">


</div>

<div id="outline-container-3-2-3-1" class="outline-5">
<h5 id="sec-3-2-3-1"><span class="section-number-5">3.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-3-1">

<ul>
<li>Race scenarios
</li>
<li>Critical regions
</li>
<li>Algorithms: 
<ul>
<li>busy-waiting
<ul>
<li>disable interrupts 
</li>
<li>Peterson's algorithm
</li>
<li>Hardware solution &mdash; TSL instruction
</li>
</ul>

</li>
<li>No busy-waiting
<ul>
<li>sleep/wake up
</li>
</ul>

</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-3-2" class="outline-5">
<h5 id="sec-3-2-3-2"><span class="section-number-5">3.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-3-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> Semaphores (2h)</h4>
<div class="outline-text-4" id="text-3-2-4">


</div>

<div id="outline-container-3-2-4-1" class="outline-5">
<h5 id="sec-3-2-4-1"><span class="section-number-5">3.2.4.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-4-1">

<ul>
<li>What's a semaphore?
</li>
<li>Why semaphore?
</li>
<li>How to use semaphore?
</li>
<li>Mutex
</li>
<li>Barriers
</li>
<li>Examples
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-4-2" class="outline-5">
<h5 id="sec-3-2-4-2"><span class="section-number-5">3.2.4.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-4-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-3-2-5" class="outline-4">
<h4 id="sec-3-2-5"><span class="section-number-4">3.2.5</span> Monitors (1h)</h4>
<div class="outline-text-4" id="text-3-2-5">


</div>

<div id="outline-container-3-2-5-1" class="outline-5">
<h5 id="sec-3-2-5-1"><span class="section-number-5">3.2.5.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-5-1">

<ul>
<li>What's a monitor?
</li>
<li>Examples
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-5-2" class="outline-5">
<h5 id="sec-3-2-5-2"><span class="section-number-5">3.2.5.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-5-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-3-2-6" class="outline-4">
<h4 id="sec-3-2-6"><span class="section-number-4">3.2.6</span> Message passing (1h)</h4>
<div class="outline-text-4" id="text-3-2-6">


</div>

<div id="outline-container-3-2-6-1" class="outline-5">
<h5 id="sec-3-2-6-1"><span class="section-number-5">3.2.6.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-6-1">

<ul>
<li>What's messaging?
</li>
<li>Examples
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-6-2" class="outline-5">
<h5 id="sec-3-2-6-2"><span class="section-number-5">3.2.6.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-6-2">

<p>     理论 + 实验
</p></div>

</div>

<div id="outline-container-3-2-6-3" class="outline-5">
<h5 id="sec-3-2-6-3"><span class="section-number-5">3.2.6.3</span> 师生活动设计</h5>
<div class="outline-text-5" id="text-3-2-6-3">

</div>
</div>

</div>

<div id="outline-container-3-2-7" class="outline-4">
<h4 id="sec-3-2-7"><span class="section-number-4">3.2.7</span> Classical IPC problems (2h)</h4>
<div class="outline-text-4" id="text-3-2-7">


</div>
