os/paperwork/unit-plan.tex
\paragraph{教学方式（手段）}
\label{sec-2-2-6-2}
理论 + 实验
\subsubsection{Why thread? (.5)}
\label{sec-2-2-7}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-7-1}
\begin{itemize}
\item Advantages
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-7-2}
理论 + 实验
\subsubsection{Thread characteristics (.5)}
\label{sec-2-2-8}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-8-1}
\begin{itemize}
\item Thread state
\item A thread has its own stack
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-8-2}
理论 + 实验
\subsubsection{Thread operation and POSIX threads (1h)}
\label{sec-2-2-9}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-9-1}
\begin{itemize}
\item Thread library calls
\item POSIX threads examples
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-9-2}
理论 + 实验
\subsubsection{User-level threads vs. kernel-level threads (.5h)}
\label{sec-2-2-10}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-10-1}
\begin{itemize}
\item pros and cons
\item Hybrid implementations
\item Programming complications
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-10-2}
理论 + 实验
\subsubsection{Linux threads (1h)}
\label{sec-2-2-11}
\paragraph{教学内容（具体到知识点）}
\label{sec-2-2-11-1}
\begin{itemize}
\item clone()
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-2-2-11-2}
理论 + 实验
\subsection{重点和难点}
\label{sec-2-3}
\begin{itemize}
\item 进程的一生
\item 线程的一生
\end{itemize}
\subsection{深化和拓宽}
\label{sec-2-4}
暂无
\subsection{教学方式（手段）及教学过程中应注意的问题}
\label{sec-2-5}
理论 + 实验
\subsection{思考题和习题}
\label{sec-2-6}
\section{进程间同步}
\label{sec-3}
\subsection{教学目标及基本要求}
\label{sec-3-1}
了解进程间协调的基本概念和方法。
\subsection{教学内容及学时分配}
\label{sec-3-2}
\begin{itemize}
\item \href{./slides/process-sync-a.pdf}{讲义}
\item \href{./slides/process-sync-b.pdf}{幻灯片}
\item \href{./lab.html#sec-4-3}{作业}
\end{itemize}
\subsubsection{Inter-process communication (.5h)}
\label{sec-3-2-1}
\paragraph{教学内容（具体到知识点）}
\label{sec-3-2-1-1}
\begin{itemize}
\item IPC issues
\item Two models of IPC
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-3-2-1-2}
理论 + 实验
\subsubsection{Shared memory (1h)}
\label{sec-3-2-2}
\paragraph{教学内容（具体到知识点）}
\label{sec-3-2-2-1}
\begin{itemize}
\item Producer-consumer problem
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-3-2-2-2}
理论 + 实验
\subsubsection{Race condition and mutual exclusion (2h)}
\label{sec-3-2-3}
\paragraph{教学内容（具体到知识点）}
\label{sec-3-2-3-1}
\begin{itemize}
\item Race scenarios
\item Critical regions
\item Algorithms: 
\begin{itemize}
\item busy-waiting
\begin{itemize}
\item disable interrupts
\item Peterson's algorithm
\item Hardware solution --- TSL instruction
\end{itemize}
\item No busy-waiting
\begin{itemize}
\item sleep/wake up
\end{itemize}
\end{itemize}
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-3-2-3-2}
理论 + 实验
\subsubsection{Semaphores (2h)}
\label{sec-3-2-4}
\paragraph{教学内容（具体到知识点）}
\label{sec-3-2-4-1}
\begin{itemize}
\item What's a semaphore?
\item Why semaphore?
\item How to use semaphore?
\item Mutex
\item Barriers
\item Examples
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-3-2-4-2}
理论 + 实验
\subsubsection{Monitors (1h)}
\label{sec-3-2-5}
\paragraph{教学内容（具体到知识点）}
\label{sec-3-2-5-1}
\begin{itemize}
\item What's a monitor?
\item Examples
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-3-2-5-2}
理论 + 实验
\subsubsection{Message passing (1h)}
\label{sec-3-2-6}
\paragraph{教学内容（具体到知识点）}
\label{sec-3-2-6-1}
\begin{itemize}
\item What's messaging?
\item Examples
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-3-2-6-2}
理论 + 实验
\paragraph{师生活动设计}
\label{sec-3-2-6-3}
\subsubsection{Classical IPC problems (2h)}
\label{sec-3-2-7}
