os/paperwork/unit-plan.org
**** 教学内容（具体到知识点）
     - The dining philosophers problem
     - The readers-writers problem
     - The sleeping barber problem
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - Semaphores
   - Classical IPC problems
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* CPU调度
** 教学目标及基本要求
   了解进程调度的基本算法
** 教学内容及学时分配
  - [[./slides/cpu-sched-a.pdf][讲义]]
  - [[./slides/cpu-sched-b.pdf][幻灯片]]
*** Scheduling introduction (1h)
**** 教学内容（具体到知识点）
     - Process scheduling queues
     - Different system has different scheduling algorithm
     - Process behavior
     - Process classification
     - Process schedulers
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Scheduling algorithms (1h)
**** 教学内容（具体到知识点）
     - Scheduling in batch systems
     - Scheduling in interactive systems
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Thread scheduling (.5h)
**** 教学内容（具体到知识点）
     - kernel-threads vs. user-threads
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Linux scheduling (1h)
**** 教学内容（具体到知识点）
     - 140 priorities
     - O(1)
     - active array, expired array
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - Scheduling algorithms
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* 死锁
** 教学目标及基本要求
   了解死锁产生的原因和处理方法。
** 教学内容及学时分配
  - [[./slides/deadlock-a.pdf][讲义]]
  - [[./slides/deadlock-b.pdf][幻灯片]]
*** Resources (.5h)
**** 教学内容（具体到知识点）
     - Processes need access to resources in reasonable order
     - Preemptable and non-preemptable resources
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Introduction to deadlock (.5h)
**** 教学内容（具体到知识点）
     - four conditions
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Deadlock modeling (.5h)
**** 教学内容（具体到知识点）
     - resource requirements graph
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Dealing with deadlocks (2h)
**** 教学内容（具体到知识点）
     - Deadlock detection and recovery
     - Deadlock avoidance
     - Deadlock prevention
     - The ostrich algorithm
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - 死锁处理方法
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* 内存管理
** 教学目标及基本要求
   了解内存管理的相关概念
** 教学内容及学时分配
  - [[./slides/mm-a.pdf][讲义]]
  - [[./slides/mm-b.pdf][幻灯片]]
  - [[./lab.html#sec-5][作业]]
