os/paperwork/unit-plan.html

<div id="outline-container-3-2-7-1" class="outline-5">
<h5 id="sec-3-2-7-1"><span class="section-number-5">3.2.7.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-7-1">

<ul>
<li>The dining philosophers problem
</li>
<li>The readers-writers problem
</li>
<li>The sleeping barber problem
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-7-2" class="outline-5">
<h5 id="sec-3-2-7-2"><span class="section-number-5">3.2.7.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-7-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>Semaphores
</li>
<li>Classical IPC problems
</li>
</ul>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-3-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-3-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-3-6">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> CPU调度</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-4-1">

<p>   了解进程调度的基本算法
</p></div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li><a href="./slides/cpu-sched-a.pdf">讲义</a>
</li>
<li><a href="./slides/cpu-sched-b.pdf">幻灯片</a>
</li>
</ul>


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Scheduling introduction (1h)</h4>
<div class="outline-text-4" id="text-4-2-1">


</div>

<div id="outline-container-4-2-1-1" class="outline-5">
<h5 id="sec-4-2-1-1"><span class="section-number-5">4.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-4-2-1-1">

<ul>
<li>Process scheduling queues
</li>
<li>Different system has different scheduling algorithm
</li>
<li>Process behavior
</li>
<li>Process classification
</li>
<li>Process schedulers
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-1-2" class="outline-5">
<h5 id="sec-4-2-1-2"><span class="section-number-5">4.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-4-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Scheduling algorithms (1h)</h4>
<div class="outline-text-4" id="text-4-2-2">


</div>

<div id="outline-container-4-2-2-1" class="outline-5">
<h5 id="sec-4-2-2-1"><span class="section-number-5">4.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-4-2-2-1">

<ul>
<li>Scheduling in batch systems
</li>
<li>Scheduling in interactive systems
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-2-2" class="outline-5">
<h5 id="sec-4-2-2-2"><span class="section-number-5">4.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-4-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> Thread scheduling (.5h)</h4>
<div class="outline-text-4" id="text-4-2-3">


</div>

<div id="outline-container-4-2-3-1" class="outline-5">
<h5 id="sec-4-2-3-1"><span class="section-number-5">4.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-4-2-3-1">

<ul>
<li>kernel-threads vs. user-threads
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-3-2" class="outline-5">
<h5 id="sec-4-2-3-2"><span class="section-number-5">4.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-4-2-3-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> Linux scheduling (1h)</h4>
<div class="outline-text-4" id="text-4-2-4">


</div>

<div id="outline-container-4-2-4-1" class="outline-5">
<h5 id="sec-4-2-4-1"><span class="section-number-5">4.2.4.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-4-2-4-1">

<ul>
<li>140 priorities
</li>
<li>O(1)
</li>
<li>active array, expired array
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-4-2" class="outline-5">
<h5 id="sec-4-2-4-2"><span class="section-number-5">4.2.4.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-4-2-4-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li>Scheduling algorithms
</li>
</ul>

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-4-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-4-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-4-6">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 死锁</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-5-1">

<p>   了解死锁产生的原因和处理方法。
</p></div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li><a href="./slides/deadlock-a.pdf">讲义</a>
</li>
<li><a href="./slides/deadlock-b.pdf">幻灯片</a>
</li>
</ul>


</div>

<div id="outline-container-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Resources (.5h)</h4>
<div class="outline-text-4" id="text-5-2-1">


</div>

<div id="outline-container-5-2-1-1" class="outline-5">
<h5 id="sec-5-2-1-1"><span class="section-number-5">5.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-5-2-1-1">

<ul>
<li>Processes need access to resources in reasonable order
</li>
<li>Preemptable and non-preemptable resources
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2-1-2" class="outline-5">
<h5 id="sec-5-2-1-2"><span class="section-number-5">5.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-5-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> Introduction to deadlock (.5h)</h4>
<div class="outline-text-4" id="text-5-2-2">


</div>

<div id="outline-container-5-2-2-1" class="outline-5">
<h5 id="sec-5-2-2-1"><span class="section-number-5">5.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-5-2-2-1">

<ul>
<li>four conditions
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2-2-2" class="outline-5">
<h5 id="sec-5-2-2-2"><span class="section-number-5">5.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-5-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> Deadlock modeling (.5h)</h4>
<div class="outline-text-4" id="text-5-2-3">


</div>

<div id="outline-container-5-2-3-1" class="outline-5">
<h5 id="sec-5-2-3-1"><span class="section-number-5">5.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-5-2-3-1">

<ul>
<li>resource requirements graph
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2-3-2" class="outline-5">
<h5 id="sec-5-2-3-2"><span class="section-number-5">5.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-5-2-3-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-5-2-4" class="outline-4">
<h4 id="sec-5-2-4"><span class="section-number-4">5.2.4</span> Dealing with deadlocks (2h)</h4>
<div class="outline-text-4" id="text-5-2-4">


</div>

<div id="outline-container-5-2-4-1" class="outline-5">
<h5 id="sec-5-2-4-1"><span class="section-number-5">5.2.4.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-5-2-4-1">

<ul>
<li>Deadlock detection and recovery
</li>
<li>Deadlock avoidance
</li>
<li>Deadlock prevention
</li>
<li>The ostrich algorithm
</li>
</ul>

</div>

</div>
