os/paperwork/unit-plan.tex
\paragraph{教学内容（具体到知识点）}
\label{sec-3-2-7-1}
\begin{itemize}
\item The dining philosophers problem
\item The readers-writers problem
\item The sleeping barber problem
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-3-2-7-2}
理论 + 实验
\subsection{重点和难点}
\label{sec-3-3}
\begin{itemize}
\item Semaphores
\item Classical IPC problems
\end{itemize}
\subsection{深化和拓宽}
\label{sec-3-4}
暂无
\subsection{教学方式（手段）及教学过程中应注意的问题}
\label{sec-3-5}
理论 + 实验
\subsection{思考题和习题}
\label{sec-3-6}
\section{CPU调度}
\label{sec-4}
\subsection{教学目标及基本要求}
\label{sec-4-1}
了解进程调度的基本算法
\subsection{教学内容及学时分配}
\label{sec-4-2}
\begin{itemize}
\item \href{./slides/cpu-sched-a.pdf}{讲义}
\item \href{./slides/cpu-sched-b.pdf}{幻灯片}
\end{itemize}
\subsubsection{Scheduling introduction (1h)}
\label{sec-4-2-1}
\paragraph{教学内容（具体到知识点）}
\label{sec-4-2-1-1}
\begin{itemize}
\item Process scheduling queues
\item Different system has different scheduling algorithm
\item Process behavior
\item Process classification
\item Process schedulers
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-4-2-1-2}
理论 + 实验
\subsubsection{Scheduling algorithms (1h)}
\label{sec-4-2-2}
\paragraph{教学内容（具体到知识点）}
\label{sec-4-2-2-1}
\begin{itemize}
\item Scheduling in batch systems
\item Scheduling in interactive systems
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-4-2-2-2}
理论 + 实验
\subsubsection{Thread scheduling (.5h)}
\label{sec-4-2-3}
\paragraph{教学内容（具体到知识点）}
\label{sec-4-2-3-1}
\begin{itemize}
\item kernel-threads vs. user-threads
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-4-2-3-2}
理论 + 实验
\subsubsection{Linux scheduling (1h)}
\label{sec-4-2-4}
\paragraph{教学内容（具体到知识点）}
\label{sec-4-2-4-1}
\begin{itemize}
\item 140 priorities
\item O(1)
\item active array, expired array
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-4-2-4-2}
理论 + 实验
\subsection{重点和难点}
\label{sec-4-3}
\begin{itemize}
\item Scheduling algorithms
\end{itemize}
\subsection{深化和拓宽}
\label{sec-4-4}
暂无
\subsection{教学方式（手段）及教学过程中应注意的问题}
\label{sec-4-5}
理论 + 实验
\subsection{思考题和习题}
\label{sec-4-6}
\section{死锁}
\label{sec-5}
\subsection{教学目标及基本要求}
\label{sec-5-1}
了解死锁产生的原因和处理方法。
\subsection{教学内容及学时分配}
\label{sec-5-2}
\begin{itemize}
\item \href{./slides/deadlock-a.pdf}{讲义}
\item \href{./slides/deadlock-b.pdf}{幻灯片}
\end{itemize}
\subsubsection{Resources (.5h)}
\label{sec-5-2-1}
\paragraph{教学内容（具体到知识点）}
\label{sec-5-2-1-1}
\begin{itemize}
\item Processes need access to resources in reasonable order
\item Preemptable and non-preemptable resources
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-5-2-1-2}
理论 + 实验
\subsubsection{Introduction to deadlock (.5h)}
\label{sec-5-2-2}
\paragraph{教学内容（具体到知识点）}
\label{sec-5-2-2-1}
\begin{itemize}
\item four conditions
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-5-2-2-2}
理论 + 实验
\subsubsection{Deadlock modeling (.5h)}
\label{sec-5-2-3}
\paragraph{教学内容（具体到知识点）}
\label{sec-5-2-3-1}
\begin{itemize}
\item resource requirements graph
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-5-2-3-2}
理论 + 实验
\subsubsection{Dealing with deadlocks (2h)}
\label{sec-5-2-4}
\paragraph{教学内容（具体到知识点）}
\label{sec-5-2-4-1}
\begin{itemize}
\item Deadlock detection and recovery
\item Deadlock avoidance
\item Deadlock prevention
\item The ostrich algorithm
\end{itemize}
