os/paperwork/unit-plan.org
*** Real-mode vs. protected-mode memory management (1.5h)
**** 教学内容（具体到知识点）
     - Relocation problem
     - Process' memory is divided into logical segments
     - Memory allocation, who/when/how?
     - Swapping
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Contiguous memory allocation (.5h)
**** 教学内容（具体到知识点）
     - first-fit, best-fit, worst-fit
     - internal-fragmentation, external-fragmentation
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Virtual memory (5h)
**** 教学内容（具体到知识点）
     - Logical memory vs. physical memory
     - Paging
       - Demand paging
       - Copy-on-write
       - Memory-mapped file
       - Page replacement algorithm
       - Allocation of frames
       - Thrashing and working set model
     - Segmentation
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - Virtual memory
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* 文件系统
** 教学目标及基本要求
   了解文件系统的基本工作原理
** 教学内容及学时分配
  - [[./slides/fs-a.pdf][讲义]]
  - [[./slides/fs-b.pdf][幻灯片]]
  - [[./lab.html#sec-6][作业]]
*** Files (1.5h)
**** 教学内容（具体到知识点）
     - What's a file?
     - File system design issues
     - File system models --- layered design
     - File attributes and types
     - File operations
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Directories (1h)
**** 教学内容（具体到知识点）
     - Single level, multi-level directories
     - Operations
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** File system implementation (3h)
**** 教学内容（具体到知识点）
     - File system layout
     - Implementing files
       - Linked-list allocation
       - Indexed allocation
     - Implementing directories
     - Shared files
     - Disk space management
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Ext2 file system (1.5h)
**** 教学内容（具体到知识点）
     - Ext2 fs layout
     - Ext2 superblock
     - Ext2 inode
     - Ext2 directory
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
