os/paperwork/unit-plan.html

<div id="outline-container-5-2-4-2" class="outline-5">
<h5 id="sec-5-2-4-2"><span class="section-number-5">5.2.4.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-5-2-4-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-5-3">

<ul>
<li>死锁处理方法
</li>
</ul>

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-5-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-5-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-5-6">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 内存管理</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-6-1">

<p>   了解内存管理的相关概念
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-6-2">

<ul>
<li><a href="./slides/mm-a.pdf">讲义</a>
</li>
<li><a href="./slides/mm-b.pdf">幻灯片</a>
</li>
<li><a href="./lab.html#sec-5">作业</a>
</li>
</ul>


</div>

<div id="outline-container-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> Real-mode vs. protected-mode memory management (1.5h)</h4>
<div class="outline-text-4" id="text-6-2-1">


</div>

<div id="outline-container-6-2-1-1" class="outline-5">
<h5 id="sec-6-2-1-1"><span class="section-number-5">6.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-6-2-1-1">

<ul>
<li>Relocation problem
</li>
<li>Process' memory is divided into logical segments
</li>
<li>Memory allocation, who/when/how?
</li>
<li>Swapping
</li>
</ul>

</div>

</div>

<div id="outline-container-6-2-1-2" class="outline-5">
<h5 id="sec-6-2-1-2"><span class="section-number-5">6.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-6-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> Contiguous memory allocation (.5h)</h4>
<div class="outline-text-4" id="text-6-2-2">


</div>

<div id="outline-container-6-2-2-1" class="outline-5">
<h5 id="sec-6-2-2-1"><span class="section-number-5">6.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-6-2-2-1">

<ul>
<li>first-fit, best-fit, worst-fit
</li>
<li>internal-fragmentation, external-fragmentation
</li>
</ul>

</div>

</div>

<div id="outline-container-6-2-2-2" class="outline-5">
<h5 id="sec-6-2-2-2"><span class="section-number-5">6.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-6-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> Virtual memory (5h)</h4>
<div class="outline-text-4" id="text-6-2-3">


</div>

<div id="outline-container-6-2-3-1" class="outline-5">
<h5 id="sec-6-2-3-1"><span class="section-number-5">6.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-6-2-3-1">

<ul>
<li>Logical memory vs. physical memory
</li>
<li>Paging
<ul>
<li>Demand paging
</li>
<li>Copy-on-write
</li>
<li>Memory-mapped file
</li>
<li>Page replacement algorithm
</li>
<li>Allocation of frames
</li>
<li>Thrashing and working set model
</li>
</ul>

</li>
<li>Segmentation
</li>
</ul>

</div>

</div>

<div id="outline-container-6-2-3-2" class="outline-5">
<h5 id="sec-6-2-3-2"><span class="section-number-5">6.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-6-2-3-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-6-3">

<ul>
<li>Virtual memory
</li>
</ul>

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-6-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-6-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-6-6">

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 文件系统</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-7-1">

<p>   了解文件系统的基本工作原理
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-7-2">

<ul>
<li><a href="./slides/fs-a.pdf">讲义</a>
</li>
<li><a href="./slides/fs-b.pdf">幻灯片</a>
</li>
<li><a href="./lab.html#sec-6">作业</a>
</li>
</ul>


</div>

<div id="outline-container-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> Files (1.5h)</h4>
<div class="outline-text-4" id="text-7-2-1">


</div>

<div id="outline-container-7-2-1-1" class="outline-5">
<h5 id="sec-7-2-1-1"><span class="section-number-5">7.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-7-2-1-1">

<ul>
<li>What's a file?
</li>
<li>File system design issues
</li>
<li>File system models &mdash; layered design
</li>
<li>File attributes and types
</li>
<li>File operations
</li>
</ul>

</div>

</div>

<div id="outline-container-7-2-1-2" class="outline-5">
<h5 id="sec-7-2-1-2"><span class="section-number-5">7.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-7-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-7-2-2" class="outline-4">
<h4 id="sec-7-2-2"><span class="section-number-4">7.2.2</span> Directories (1h)</h4>
<div class="outline-text-4" id="text-7-2-2">


</div>

<div id="outline-container-7-2-2-1" class="outline-5">
<h5 id="sec-7-2-2-1"><span class="section-number-5">7.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-7-2-2-1">

<ul>
<li>Single level, multi-level directories
</li>
<li>Operations
</li>
</ul>

</div>

</div>

<div id="outline-container-7-2-2-2" class="outline-5">
<h5 id="sec-7-2-2-2"><span class="section-number-5">7.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-7-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-7-2-3" class="outline-4">
<h4 id="sec-7-2-3"><span class="section-number-4">7.2.3</span> File system implementation (3h)</h4>
<div class="outline-text-4" id="text-7-2-3">


</div>

<div id="outline-container-7-2-3-1" class="outline-5">
<h5 id="sec-7-2-3-1"><span class="section-number-5">7.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-7-2-3-1">

<ul>
<li>File system layout
</li>
<li>Implementing files
<ul>
<li>Linked-list allocation
</li>
<li>Indexed allocation
</li>
</ul>

</li>
<li>Implementing directories
</li>
<li>Shared files
</li>
<li>Disk space management
</li>
</ul>

</div>

</div>

<div id="outline-container-7-2-3-2" class="outline-5">
<h5 id="sec-7-2-3-2"><span class="section-number-5">7.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-7-2-3-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-7-2-4" class="outline-4">
<h4 id="sec-7-2-4"><span class="section-number-4">7.2.4</span> Ext2 file system (1.5h)</h4>
<div class="outline-text-4" id="text-7-2-4">


</div>

<div id="outline-container-7-2-4-1" class="outline-5">
<h5 id="sec-7-2-4-1"><span class="section-number-5">7.2.4.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-7-2-4-1">

<ul>
<li>Ext2 fs layout
</li>
<li>Ext2 superblock
</li>
<li>Ext2 inode
</li>
<li>Ext2 directory
</li>
</ul>

</div>

</div>
