os/paperwork/unit-plan.tex
\paragraph{教学方式（手段）}
\label{sec-5-2-4-2}
理论 + 实验
\subsection{重点和难点}
\label{sec-5-3}
\begin{itemize}
\item 死锁处理方法
\end{itemize}
\subsection{深化和拓宽}
\label{sec-5-4}
暂无
\subsection{教学方式（手段）及教学过程中应注意的问题}
\label{sec-5-5}
理论 + 实验
\subsection{思考题和习题}
\label{sec-5-6}
\section{内存管理}
\label{sec-6}
\subsection{教学目标及基本要求}
\label{sec-6-1}
了解内存管理的相关概念
\subsection{教学内容及学时分配}
\label{sec-6-2}
\begin{itemize}
\item \href{./slides/mm-a.pdf}{讲义}
\item \href{./slides/mm-b.pdf}{幻灯片}
\item \href{./lab.html#sec-5}{作业}
\end{itemize}
\subsubsection{Real-mode vs. protected-mode memory management (1.5h)}
\label{sec-6-2-1}
\paragraph{教学内容（具体到知识点）}
\label{sec-6-2-1-1}
\begin{itemize}
\item Relocation problem
\item Process' memory is divided into logical segments
\item Memory allocation, who/when/how?
\item Swapping
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-6-2-1-2}
理论 + 实验
\subsubsection{Contiguous memory allocation (.5h)}
\label{sec-6-2-2}
\paragraph{教学内容（具体到知识点）}
\label{sec-6-2-2-1}
\begin{itemize}
\item first-fit, best-fit, worst-fit
\item internal-fragmentation, external-fragmentation
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-6-2-2-2}
理论 + 实验
\subsubsection{Virtual memory (5h)}
\label{sec-6-2-3}
\paragraph{教学内容（具体到知识点）}
\label{sec-6-2-3-1}
\begin{itemize}
\item Logical memory vs. physical memory
\item Paging
\begin{itemize}
\item Demand paging
\item Copy-on-write
\item Memory-mapped file
\item Page replacement algorithm
\item Allocation of frames
\item Thrashing and working set model
\end{itemize}
\item Segmentation
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-6-2-3-2}
理论 + 实验
\subsection{重点和难点}
\label{sec-6-3}
\begin{itemize}
\item Virtual memory
\end{itemize}
\subsection{深化和拓宽}
\label{sec-6-4}
暂无
\subsection{教学方式（手段）及教学过程中应注意的问题}
\label{sec-6-5}
理论 + 实验
\subsection{思考题和习题}
\label{sec-6-6}
\section{文件系统}
\label{sec-7}
\subsection{教学目标及基本要求}
\label{sec-7-1}
了解文件系统的基本工作原理
\subsection{教学内容及学时分配}
\label{sec-7-2}
\begin{itemize}
\item \href{./slides/fs-a.pdf}{讲义}
\item \href{./slides/fs-b.pdf}{幻灯片}
\item \href{./lab.html#sec-6}{作业}
\end{itemize}
\subsubsection{Files (1.5h)}
\label{sec-7-2-1}
\paragraph{教学内容（具体到知识点）}
\label{sec-7-2-1-1}
\begin{itemize}
\item What's a file?
\item File system design issues
\item File system models --- layered design
\item File attributes and types
\item File operations
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-7-2-1-2}
理论 + 实验
\subsubsection{Directories (1h)}
\label{sec-7-2-2}
\paragraph{教学内容（具体到知识点）}
\label{sec-7-2-2-1}
\begin{itemize}
\item Single level, multi-level directories
\item Operations
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-7-2-2-2}
理论 + 实验
\subsubsection{File system implementation (3h)}
\label{sec-7-2-3}
\paragraph{教学内容（具体到知识点）}
\label{sec-7-2-3-1}
\begin{itemize}
\item File system layout
\item Implementing files
\begin{itemize}
\item Linked-list allocation
\item Indexed allocation
\end{itemize}
\item Implementing directories
\item Shared files
\item Disk space management
\end{itemize}
\paragraph{教学方式（手段）}
\label{sec-7-2-3-2}
理论 + 实验
\subsubsection{Ext2 file system (1.5h)}
\label{sec-7-2-4}
\paragraph{教学内容（具体到知识点）}
\label{sec-7-2-4-1}
\begin{itemize}
\item Ext2 fs layout
\item Ext2 superblock
\item Ext2 inode
\item Ext2 directory
\end{itemize}
