os/paperwork/unit-plan.org
*** Virtual file system (1.5h)
**** 教学内容（具体到知识点）
     - Why VFS? 
     - FS mounting
     - Linux VFS
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - File system implementation
   - Ext2 FS
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目
** 思考题和习题

# +BIBLIOGRAPHY: os plain limit:t option:-u
   
#+BEGIN_LaTeX
\bibliographystyle{plain}
\bibliography{os}
#+END_LaTeX
   
