os/paperwork/unit-plan.html

<div id="outline-container-7-2-4-2" class="outline-5">
<h5 id="sec-7-2-4-2"><span class="section-number-5">7.2.4.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-7-2-4-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-7-2-5" class="outline-4">
<h4 id="sec-7-2-5"><span class="section-number-4">7.2.5</span> Virtual file system (1.5h)</h4>
<div class="outline-text-4" id="text-7-2-5">


</div>

<div id="outline-container-7-2-5-1" class="outline-5">
<h5 id="sec-7-2-5-1"><span class="section-number-5">7.2.5.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-7-2-5-1">

<ul>
<li>Why VFS? 
</li>
<li>FS mounting
</li>
<li>Linux VFS
</li>
</ul>

</div>

</div>

<div id="outline-container-7-2-5-2" class="outline-5">
<h5 id="sec-7-2-5-2"><span class="section-number-5">7.2.5.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-7-2-5-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-7-3">

<ul>
<li>File system implementation
</li>
<li>Ext2 FS
</li>
</ul>

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-7-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-7-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> 参考书目</h3>
<div class="outline-text-3" id="text-7-6">

</div>

</div>

<div id="outline-container-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-7-7">




</div>
</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: 王晓林 (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2012-08-15 Wed</p>

</div>
</body>
</html>
